[
    {
        "title": "O futuro vai chegar, basta saber quem participará do seu processo de criação",
        "date": "2023-02-06",
        "id": 4,
        "paragraphs": [
            {
                "text": "Gostamos de especular sobre o futuro, é uma forma de nos desprendermos do presente e desejar cenários mais instigantes. Nunca imaginamos um processo, mas uma finalização: um mundo virtual, carros voadores ou qualquer outro assunto é tratado de forma acabada. Porém projetamos situações de futuro sem a mudança de comportamento e sociedade, o que significa que cometemos um anacronismo. Junto da euforia gerada pelas possibilidades que a tecnologia revela, este erro cronológico pode ser o fator pelo qual não discutimos certos assuntos.",
                "subtitle": false
            },
            {
                "text": "Utilizar modelos de Inteligência Artificial (IA) para realizar tarefas sintéticas, como a escrita de textos e a criação de ilustrações ao gosto do usuário, parece ser um estado da arte realmente magnífico. Haveria algum problema nisso? Bom, vamos posicionar a IA na sociedade. Existem pessoas hoje que se desenvolvem para serem escritores ou artistas, buscando potencializar a sua maestria dia a dia para aperfeiçoar as suas técnicas. E se, da noite para o dia, uma máquina começa a gerar tais produtos com a qualidade de um sênior, o que acontece com os aspirantes? A frustração de comparar o próprio trabalho com o realizado por uma máquina pode gerar uma perda de talentos, de modo que algumas áreas deixem de existir simplesmente porque os novatos não conseguem espaço.",
                "subtitle": false
            },
            {
                "text": "Sem levar em consideração como os modelos funcionam e o debate de plágio, podemos imaginar uma sociedade futura em que os trabalhos de escrita e ilustração sejam unicamente feitos por IA. Neste mundo, não existirão novas obras para alimentar o algoritmo, logo não existirá fluxo de feedback e o processo de treinamento não é refeito. Por fim, teremos sempre o mesmo estilo de texto e imagem, com o pequeno ruído na resposta que os modelos podem calibrar. Assim, duas áreas se tornam totalmente padronizadas e empacotadas pelos donos da máquina, afinal o processo de Machine Learning para criação foi desenvolvido dentro de uma empresa X, seguindo protocolos de treinamento Y, ambos não disponíveis para toda a população.",
                "subtitle": false
            },
            {
                "text": "Conseguimos pensar em muitas possibilidades para a tecnologia, mas e para o ser humano? Se o que nos diferencia é o trabalho imaginativo e introspectivo, a partir do momento que este puder ser substituído por uma máquina, o que nos diferencia de outros animais?",
                "subtitle": false
            },
            {
                "text": "Talvez a resposta esteja na premissa de que as máquinas serão capazes de realizar trabalhos criativos. De fato, técnicas de Machine Learning (ML) permitem que algoritmos transformem um conjunto de dados históricos em uma função matemática capaz de modelar o sistema, este é o fundamento da técnica e também a sua principal limitação. Em outras palavras, um modelo só aprende com o que aconteceu e foi devidamente validado.",
                "subtitle": false
            },
            {
                "text": "Existe um grande frenesi de que as máquinas aprenderiam com os próprios erros, mas esta é uma meia verdade. Atribuo essa desinformação à má divulgação da técnica de reinforcement learning. Novamente, existe uma publicidade e um lobby forte em volta dos assuntos de tecnologia, que invariavelmente atuam sobre as empresas de mídia. O debate sobre a presença humana não ocorre, de modo que estamos presos em um ciclo vicioso das pautas feitas pelos donos dos sistemas.",
                "subtitle": false
            },
            {
                "text": "De todo modo, é um fato que estamos em um período de transição. Quando imaginamos o futuro não pensamos neste processo, apenas no resultado final, do mundo prateado e com terminais de acesso ao espaço virtual pela rua. Porém a utopia, ou a distopia, não acontece instantaneamente. A consolidação do futuro ocorre no transitar da história, onde os fundamentos para uma nova organização são feitos. Esta discussão está sendo realizada, principalmente pelas Big Techs, mas nós como sociedade não estamos participando. É bem verdade que nem fomos convidados.",
                "subtitle": false
            },
            {
                "text": "Podemos utilizar a história para tentar mensurar o impacto que é não participar desse debate. Com a inclusão dos combustíveis fósseis na economia, máquinas começaram a ser viáveis financeiramente e a população se tornou refém dos donos destes equipamentos. O trabalho, ação material de criação de pertencimento e identidade social, foi completamente alterado e as pessoas passaram por um período de grande tensão.",
                "subtitle": false
            },
            {
                "text": "Seria interessante carregar esses dados sociais históricos em um modelo de ML e verificar a sua previsão para uma revolução tecnológica atualmente. Número de pessoas e nível de desigualdade são fatores que poderiam influenciar consideravelmente para a instauração de um caos. Apenas altamente qualificados poderão andar ao lado das máquinas, mas todo o resto passa a ser completamente descartável. Qual o nosso plano como sociedade para absorver esta configuração?",
                "subtitle": false
            },
            {
                "text": "Neste momento os idealistas clamam a educação como sua carta trunfo, mas falta materialidade e cálculo nesta proposta. Este debate educacional possui uma falha considerável, que é a questão do tempo. Não se produzem engenheiros rapidamente, mas testadores são fáceis de produzir. Gratuitamente trabalhamos como curadores de conteúdo e geradores de dados para o treinamento e refino dos modelos de ML existentes no mercado, que estão cada vez mais espertos. Por outro lado, caminhamos para nos tornarmos cada vez menos inteligentes, ironicamente.",
                "subtitle": false
            },
            {
                "text": "Este texto está congelado no tempo, é início de 2023. Projetos de IA não surgirão na calada da noite, mas estão em andamento neste momento. Quanto menos informação sobre os fundamentos de ML e do que está por trás de modelos de inteligência, mais um marketing fervoroso consegue manipular a opinião pública para um determinado ponto. Precisamos tomar posse do papel do ser humano no processo, separando um pouco a ficção de IAs manipuladoras no espaço do que é factual. O futuro é uma permeação da inteligência artificial na sociedade, com uma forte interação entre ela e as pessoas, não uma substituição. Porém, quem terá o direito de participar deste novo mundo pode ser a questão principal que deverá ser respondida.",
                "subtitle": false
            }
        ]
    },
    {
        "title": "Deixem as máquinas trabalharem, mas só sobre as massas",
        "date": "2023-01-05",
        "id": 3,
        "paragraphs": [
            {
                "text": "Toda era tem a sua fixação com o presente e o futuro. As pessoas do século passado fantasiavam o século atual como um tempo de alta tecnologia, dominada pela prata. Já os escritores cyberpunch projetavam sombras, sujeira e controle corporativo da vida das pessoas. Quem poderia imaginar que experimentaríamos uma espécie de síntese?",
                "subtitle": false
            },
            {
                "text": "A grande obsessão da atualidade são as inteligências artificiais (IAs). E aqui cabe o termo, pois o que temos é um fascínio por uma entidade inexistente e que ninguém compreende, mas que todos já atribuem a ela o século. Todavia é importante ir além das manchetes, avançar um pouco no oceano das máquinas e refinar um tanto essa relação high tech dos algoritmos que constroem o futuro.",
                "subtitle": false
            },
            {
                "text": "O entendimento se torna mais fácil ao fixar uma determinada característica sobre esse tipo de sistema: todo modelo de machine learning (ML) utiliza dados passados para formatar uma equação, matemática ou lógica, que seja capaz de criar uma saída a partir de série de variáveis de entrada. De modo direto, dada uma série de variáveis “x”, o modelo transforma estes valores em uma variável “y” que é o objeto de interesse. Como exemplo simples, a partir de uma foto de animal (x) o modelo informa que o animal é um gato (y). Este é o fundamento de qualquer IA.",
                "subtitle": false
            },
            {
                "text": "Assim, o histórico utilizado na criação é que define como o modelo encontrará as suas previsões. Isso funciona para tradução de texto, reconhecimento de imagem, simuladores de chat e geração de texto. Dessa forma, é possível abandonar a ideia de “magia” que envolve esse tipo de sistema, uma vez que o seu conceito é extremamente simples, embora o seu desenvolvimento matemático seja complexo.",
                "subtitle": false
            },
            {
                "text": "Mas voltemos ao início, ao mundo cyberpunk transvestido. IAs não são boas e nem ruins, são ferramentas. O fascínio sem entendimento é que gera o agravamento da situação social. Para exemplificar, quando o RH utiliza um modelo de ML para selecionar os melhores candidatos para uma vaga, o software seleciona dentre os inscritos aqueles que mais se assemelham aos atuais funcionários da empresa (considerando que esse foi a base utilizada para criação do modelo), ou seja, pessoas diferentes são sumariamente descartadas, reduzindo a diversidade. E com o tempo, a seleção da IA tende a fazer com que todo o quadro de funcionários seja absolutamente igual, é um ciclo de feedback vicioso.",
                "subtitle": false
            },
            {
                "text": "Os algoritmos podem atuar na educação, saúde, entretenimento, finanças ou outros, sua única exigência é um histórico com informações que podem ser utilizados para gerar uma saída específica. Porém, a sua aplicação sem o devido conhecimento do funcionamento e formas de avaliação e correção apenas contribui para a desigualdade.",
                "subtitle": false
            },
            {
                "text": "Obviamente um software que reduz o trabalho massivo de um avaliador, que busca por um bom candidato para ingressar em uma universidade de prestígio ou preencher uma vaga em uma empresa gigante, será extremamente apelativo. O benefício para estas pessoas é imenso e no fim, pouco impacta a faculdade ou a empresa se os seus membros são todos iguais ou se contribuem para a desigualdade, porque esta não é a métrica de performance delas.",
                "subtitle": false
            },
            {
                "text": "A taxação por IA não se limita à meios profissionais ou educacionais. Sua abordagem é tão orgânica que pouco nos importamos. O YouTube ou Spotify recomendando conteúdo são formas de ensilar pessoas e reforçar determinadas ideias para públicos específicos. Indivíduos com determinado gosto (ou taxados com determinado gosto pelo algoritmo, um preconceito considerado legal) serão bombardeados com tópicos semelhantes com o único objetivo de retenção. E o ciclo vicioso se aplica aqui, quanto mais acesso e mais tempo em determinado assunto, mais o algoritmo entrega. Porém o engajamento não é totalmente orgânico, foi condicionado por uma máquina que utiliza uma base de dados interna para suas sugestões, uma vez que a máquina pode simplesmente alocar um indivíduo em um silo de pessoas parecidas e assim tratá-la. E no fim, ninguém se pergunta que dados e grupos são utilizados.",
                "subtitle": false
            },
            {
                "text": "Uma vez que o conhecimento não é compartilhado, as pessoas sequer imaginam o quão destrutivos são estes algoritmos. As máquinas se tornam verdadeiras fabricadoras de comportamento nas massas, condicionando-as a pensar ou agir de determinada maneira. Para ilustrar, voltemos ao mundo profissional. A grande ansiedade das pessoas que buscam emprego é montar um currículo que seja amigável para um crawler recuperar informações, além de descobrir e alocar no documento as palavras que melhor pontuam no ranking dos modelos. Uma verdadeira desumanização e, se parar pra pensar, uma loucura.",
                "subtitle": false
            },
            {
                "text": "E se me permite, faço a provocação: algum diretor, herdeiro ou outro medalhão precisa se preocupar com robôs lendo suas informações para definir um trabalho, uma promoção ou uma vaga em universidade? Não, porque para uma parcela seleta da sociedade sempre existirão humanos reais dispostos a gastar tempo com ela. Esta é a desigualdade do século XXI, as mega corporações cyberpunk, hoje chamadas big tech, são donas de toda a rede de informação e capazes de decidir quem é digno de tratamento de máquina e quem recebe o seleto apoio humano.",
                "subtitle": false
            },
            {
                "text": "Talvez a literatura tenha alertado as corporações, pois com a propaganda tecnocrática e o uso de uma entidade abstrata e sem viés chamada de algoritmo são capazes de manter o status quo e aprofundar a desigualdade. E tudo de forma totalmente orgânica, contando com a desinformação e uma série de gatilhos mentais na sua poderosa máquina de publicidade.",
                "subtitle": false
            },
            {
                "text": "Infelizmente combater esse movimento não é fácil, sobretudo sem a força de uma regulamentação global forte. Porém estamos sempre atrasados e enquanto as leis são nacionais, as corporações são internacionais. Se determinado país se manifestar contra uma prática específica, basta transferir o centro de operação para outro e apenas extrair as informações do queixoso. Sempre busco manter a esperança, mas preciso confessar que quando paro para refletir sobre a utilização dos modelos desta forma, a aniquilação da raça parece mais provável.",
                "subtitle": false
            },
            {
                "text": "Indicações",
                "subtitle": true
            },
            {
                "text": "Toda essa reflexão é apenas uma pequena pincelada do trabalho de Cathy O’Neil no livro “Algoritmos de Destruição em Massa”. Considero uma leitura importante para aprofundar no assunto. Fica claro que o objetivo maior das máquinas não é escolher os melhores, mas prover uma forma rápida de eliminar a maior parte possível e criar um cenário de escassez. E como não existe transparência, esse processo de eliminação pode ser uma simples simulação de Monte Carlo.",
                "subtitle": false
            }
        ]
    },
    {
        "title": "Mantendo copyright a expansão tecnológica não passa de tecnocracia repaginada",
        "date": "2022-11-17",
        "id": 2,
        "paragraphs": [
            {
                "text": "Posso arriscar, com relativa certeza, de que você que está aqui agora já escutou que o desenvolvimento tecnológico é o futuro. De fato, não existe nada de errado com o postulado, porém nem sempre a operacionalização de um conceito elementar é simples. Vamos nos debruçar sobre alguns pontos não visíveis desse futuro, tomando como fio condutor softwares como nosso produto de análise.",
                "subtitle": false
            },
            {
                "text": "A ideia principal de um software é transformar conhecimento técnico de desenvolvimento na solução do problema de alguém (pessoa, empresa, comunidade etc). Assim, existem duas partes envolvidas diretamente neste processo: aquele que cria e aquele que consome. Em outras palavras, existe alguém que dispõe de informação técnica (know how) e existe outro que demanda o produto. Normalmente estas duas partes chegam em um acordo por meio de um contrato, em que o criador presta o serviço em troca de algum benefício.",
                "subtitle": false
            },
            {
                "text": "Parece muito lógico, afinal trata-se de um mero escambo na sua essência. O que poderia existir de complexo? Bom, o distúrbio acontece com a alienação, dado que as duas partes se enfrentam como isoladas e as vezes até inimigas.",
                "subtitle": false
            },
            {
                "text": "O lado criador entende que seu principal insumo é a técnica. Esta crença faz com que ele coloque uma viseira e não consiga compreender nada além de sintaxe da linguagem A ou B. Um software descolado da realidade, austero em seu cerne, jamais vai cumprir seu papel original: resolver um problema. O afastamento do contexto por parte do criador transforma-o em um mero executor, cumpridor de requisições, incapaz de perceber que o seu produto será utilizado por pessoas, incorporando o cotidiano pessoal ou profissional delas. “Tempos Modernos” hoje retrataria um indivíduo encurvado em frente ao computador escrevendo linhas de código freneticamente.",
                "subtitle": false
            },
            {
                "text": "Pelo lado do consumidor o impasse é mais claro. Problemas, ideias de melhoria e desejos sempre existem, mas e o recurso necessário para execução está disponível? O custo para solucionar um obstáculo não é visto de outra forma senão um custo. Considerando o software como uma riqueza gerada, para a sua geração é preciso trabalho, que somente pode ser oferecido pelo criador por meio de uma troca. O foco apenas nessa relação contratual também aliena o problema original, pois agora o questionamento está em formular um contrato que seja vantajoso para ambos os lados.",
                "subtitle": false
            },
            {
                "text": "Dentro deste contexto, a palavra chave é alienação. O criador reduz seu trabalho no simples conhecimento técnico (escrever código) e o contratante se limita a listar suas vontades e ajustar um acordo capaz de equalizar as duas partes. Assim, ambos se prendem ao nominal, ao descritivo, à quantidade de nomes complexos de tecnologias X, Y ou Z para determinar o que será o produto. Neste ponto, o problema original não importa, pois o foco está em criar alguma coisa com o mais recente avanço tecnológico, somente isso.",
                "subtitle": false
            },
            {
                "text": "Nessa pintura de indiferença, quem se beneficia? O dono do mercado da esquina? O jovem estudante de programação? Os trabalhadores de uma fábrica ou de uma loja? O programador de uma cidade do interior? Uma comunidade cuja principal atividade é o turismo? O programador e produtor de conteúdo mais aliciado do YouTube? Ou seriam os grandes conglomerados tecnológicos (Big Techs) que concentram todo o conhecimento do mundo?",
                "subtitle": false
            },
            {
                "text": "Enquanto os produtos tecnológicos são reduzidos a esta relação em que as partes não entendem as particularidades entre si, não ocorre capilaridade dos avanços tecnológicos. Por mais que você faça um ou dois cursos de programação e consiga criar uma API, se este sistema não for utilizado por pessoas reais você não gerou conhecimento, apenas fez exercícios de fixação de livros didáticos.",
                "subtitle": false
            },
            {
                "text": "E não se engane programador, você aliena seu ofício como qualquer outro trabalhador, você não faz parte dos consortes da Meta, Alphabet ou Microsoft, você faz parte de uma sociedade capilar do país, talvez longe dos grandes centros. Existe distância entre o seu trabalho e a geração de conhecimento para a sua cidade. Sua produção fica retida ao contexto profissional para o qual você presta serviço.",
                "subtitle": false
            },
            {
                "text": "Se o conhecimento fosse mesmo capilar, por que uma comunidade do interior de Minas Gerais não pode ter um sistema de comunicação, solicitação de serviços e venda de produtos sem passar por intermediadores internacionais? A resposta é só porque não existem técnicos por lá capazes de realizar tal trabalho? Ora, mas não vivem falando que o conhecimento hoje está totalmente democratizado, com YouTube e Google como fonte de pesquisa?",
                "subtitle": false
            },
            {
                "text": "O fato é que existem diversas barreiras, mas uma delas é que não nos ensinam a solucionar problemas locais. Nosso objetivo sempre precisa ser megalomaníaco, impactando milhares de pessoas ao longo do planeta em uma arquitetura extremamente rebuscada e utilizando todo o ecossistema mais avançado de um provedor de serviços de nuvem. E assim, o sonho das pessoas de uma cidade pequena passa a ser fugir dela e ir para os grandes centros de desenvolvimento. Todavia, existem mais periferias do que centros.",
                "subtitle": false
            },
            {
                "text": "A produção de tecnologia precisa ser democratizada em si, com todo o seu conhecimento e estudos de caso. Os famosos padrões de projeto (design patterns) foram criados com o compartilhamento de soluções para problemas, fundamentando a boa escrita de código pelos programadores. Para atingirmos uma verdadeira revolução tecnológica, as aplicações também precisam ser compartilhadas. O apego ao sentimento de “dono” apenas trava o sistema. Por mais que você acredite que vai conseguir royalties e exclusividade do seu produto, em algum momento alguém vai conseguir criar algo parecido ou melhor.",
                "subtitle": false
            },
            {
                "text": "O compartilhamento de experiências e casos de aplicabilidade gera um ecossistema de revolução tecnológica, onde um membro de uma fábrica de sapato consegue identificar algo da sua rotina que pode ser aprimorado por meio de uma tecnologia utilizada em uma loja de doces. É perfeitamente possível que uma ideia aplicada na doceria contenha percepções valiosas que podem ser expandidas. A doceria pode não ter interesse em expandir a solução por si só, mas ao juntar vários interessados um desenvolvimento coletivo passa a ser viável.",
                "subtitle": false
            },
            {
                "text": "Por outro lado, o ensilamento das experiências e experimentos reais só interessa àqueles que dominam o sistema. Quanto mais conhecimento concentrado, tratando as periferias como verdadeiros imbecis que devem se limitar a consumir os seus produtos. E quando a demanda não se manifesta organicamente, basta criá-la. É bom lembrar que todos nós vivemos sem um aplicativo de venda de comida, poisa a qualquer momento podemos ligar para a loja e solicitar a entrega. Neste caso, muitas vezes você pagará menos, uma vez que a taxa de intermediação cobrada pelo aplicativo não estará inclusa no preço do seu lanche.",
                "subtitle": false
            },
            {
                "text": "A revolução tecnológica só acontecerá quando as pessoas se entenderem como parte do processo de criação e não de puro consumo. Criadores e contratantes estão mais próximos do que imaginam e podem conviver em uma sociedade local capaz de gerar inovação, transformando de forma significativa e diretamente a sociedade próxima em que vivem. Para isso o conhecimento local não deve ser simplificado ou concentrado, precisa ser amplo, difuso, colaborativo e representando o estado da arte. Caso contrário, tecnologia nunca será vista como algo diferente do mundo cyberpunch da literatura e a periferia nunca deixará de ser periferia.",
                "subtitle": false
            },
            {
                "text": "Indicações",
                "subtitle": true
            },
            {
                "text": "Grande parte da motivação para a escrita deste texto se deu após a minha leitura de conteúdos de economia. A economia real é fazer a sociedade funcionar, algo que se assemelha muito com a ideia de engenharia que tanto me atrai. Vou me limitar a citar um livro: “O que é poder local?”, do economista Ladislau Dowbor.",
                "subtitle": false
            }
        ]
    },
    {
        "title": "Técnica versus Crítica",
        "date": "2022-11-08",
        "id": 1,
        "paragraphs": [
            {
                "text": "Esta é a contradição que possivelmente guia todo o meu trabalho. A técnica se sobrepõe ao ambiente ou o contrário? Até quando é possível dizer que alguma ação é puramente tecnicista e não possui influência humana? Na minha planilha eletrônica é muito fácil somar uma série de números, mas o que eles significam no mundo real? Posso transformar todas do mundo em equações ou classes?",
                "subtitle": false
            },
            {
                "text": "Bom, melhor parar por enquanto, pois acredito que meu objetivo inicial de provocação foi cumprimo. O fato é que tenho mais incertezas do que certezas, por isso tento sempre refletir sobre as minhas atividades. Não tenho como aspiração deixar uma marca no mundo, mas não sou inocente ao ponto de achar que sou completamente imparcial quanto à ideologia. De uma forma ou de outra a minha construção humana interfere no meu trabalho e é por isso que preciso inaugurar este espaço com a contradição da minha vida.",
                "subtitle": false
            },
            {
                "text": "Estejam prontos para compartilhar das controvérsias de um engenheiro de formação e desenvolvedor por subversão, é o momento de ressignificar a engenharia social.",
                "subtitle": false
            }
        ]
    }
]