[
    {
        "title": "Deixem as máquinas trabalharem, mas só sobre as massas",
        "date": "2023-01-05",
        "paragraphs": [
            {
                "text": "Toda era tem a sua fixação com o presente e o futuro. As pessoas do século passado fantasiavam o século atual como um tempo de alta tecnologia, dominada pela prata. Já os escritores cyberpunch projetavam sombras, sujeira e controle corporativo da vida das pessoas. Quem poderia imaginar que experimentaríamos uma espécie de síntese?",
                "subtitle": false
            }
        ]
    },
    {
        "title": "Mantendo copyright a expansão tecnológica não passa de tecnocracia repaginada",
        "date": "2022-11-17",
        "paragraphs": [
            {
                "text": "Posso arriscar, com relativa certeza, de que você que está aqui agora já escutou que o desenvolvimento tecnológico é o futuro. De fato, não existe nada de errado com o postulado, porém nem sempre a operacionalização de um conceito elementar é simples. Vamos nos debruçar sobre alguns pontos não visíveis desse futuro, tomando como fio condutor softwares como nosso produto de análise.",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            },
            {
                "text": "",
                "subtitle": false
            }
        ]
    },
    {
        "title": "Técnica versus Crítica",
        "date": "2022-11-08",
        "paragraphs": [
            {
                "text": "Esta é a contradição que possivelmente guia todo o meu trabalho. A técnica se sobrepõe ao ambiente ou o contrário? Até quando é possível dizer que alguma ação é puramente tecnicista e não possui influência humana? Na minha planilha eletrônica é muito fácil somar uma série de números, mas o que eles significam no mundo real? Posso transformar todas do mundo em equações ou classes?",
                "subtitle": false
            },
            {
                "text": "Bom, melhor parar por enquanto, pois acredito que meu objetivo inicial de provocação foi cumprimo. O fato é que tenho mais incertezas do que certezas, por isso tento sempre refletir sobre as minhas atividades. Não tenho como aspiração deixar uma marca no mundo, mas não sou inocente ao ponto de achar que sou completamente imparcial quanto à ideologia. De uma forma ou de outra a minha construção humana interfere no meu trabalho e é por isso que preciso inaugurar este espaço com a contradição da minha vida.",
                "subtitle": false
            },
            {
                "text": "Estejam prontos para compartilhar das controvérsias de um engenheiro de formação e desenvolvedor por subversão, é o momento de ressignificar a engenharia social.",
                "subtitle": false
            }
        ]
    }
]