[
    {
        "title": "Mushishi (Yuki Urushibara)",
        "text": "As histórias contadas em Mushishi usam o sobrenatural para criar uma alegoria de questões filosóficas da existência humana. Aquilo que ignoramos ou desconhecemos não deixa de existir através da negação. Lidar com o inexplorado não é uma tarefa agradável e nem finita. Existem histórias que não conseguiremos finalizar, porque o mundo é muito maior do que o nosso tempo de existência."
    },
    {
        "title": "O pescador ambicioso e o peixe encantado (Leonardo Boff)",
        "text": "Através do conto famoso, a discussão se desenvolve pela justa medida, pelo ponto de equilíbrio que permite a existência. E semelhante ao equilíbrio termodinâmico, o aprumo da sociedade é dinâmico, precisa ser refletido a todo momento. Desejos são infinitos, mas o mundo material só lida com grandezas finitas. No fim, quando o pescador tenta ultrapassar o limite material, o resultado é o retorno ao início, o que podemos até refletir sobre o “eterno retorno”."
    },
    {
        "title": "A era do capital improdutivo (Ladislau Dowbor)",
        "text": "O fio condutor do texto é a convergência de crises (valores, pandemia, demografia, cultura, ambiental e financeira), que resulta em uma nova configuração econômica, onde a extração e o rentismo assumem papéis centrais no jogo econômico. A evolução tecnológica causou mudanças que não foram acompanhadas pela governança, causando uma má gestão de recursos ao longo do globo. Um ponto bem interessante são os trabalhos de outros atores apresentados durante o texto e nas referências, constituindo boas fontes sobre o assunto para além do básico."
    },
    {
        "title": "O que é poder local? (Ladislau Dowbor)",
        "text": "Uma leitura rápida, porém bem reflexiva. É comum pensarmos em soluções de cima pra baixo, em uma governança centralizada. Tal visão é uma terceirização de responsabilidade, uma vez que a descentralização permite verdadeira capilaridade e crescimento. Emancipar mentes, pessoas e localidades para que possam ser capazes de planejar as ações da vizinhança é um caminho mais abrangente, porém bem mais difícil e exige trabalho, o que não deveria ser um problema."
    },
    {
        "title": "O pão nosso de cada dia (Ladislau Dowbor)",
        "text": "Ao partir da convergências de crises da Era do Capital Improdutivo, o livro busca passar por cada setor em crise com maior nível de detalhe. Os pontos de divergência e as formas de controle são o ponto forte. No fim, a economia tem como objetivo algo próximo da engenharia: fazer a sociedade funcionar para todas as pessoas, por isso é preciso ter o “pão de cada dia”, ou seja, o bem fazer para que seja possível a obtenção de sustento hoje e amanhã."
    },
    {
        "title": "O mundo assombrado pelos demônios (Carl Segan)",
        "text": "Como divulgador, Carl passa por diversos assuntos que geram algum impacto na capilaridade da ciência. Não escapa das divergências dentro do próprio mundo científico, deixando claro os desacordos com companheiros, mas prezando pela manutenção do método em todo momento. O assombroso é que o texto de 1995 parece hoje uma profecia apocalíptica, pois o mundo tenebroso pintado pelo autor parece ser real em 2022."
    },
    {
        "title": "O conto da Aia (Margaret Atwood)",
        "text": "Uma crítica política e social impecável. Diferente de outras ficções com elementos claramente irreais (viagens espaciais, engenharia super avançada e afins), o conto poderia se passar hoje, dado o nível de negacionismo e comportamento de massa. O último capítulo coroa a obra com um final que me fez questionar se o texto que li não era na verdade um registro histórico. E de fato todo o ambiente é montado de modo tão coerente com o presente que a própria definição de futuro distópico se torna menos aterrorizante."
    },
    {
        "title": "Enraizado (Naomi Novik)",
        "text": "Gosto particularmente desta história pelo contraste entre o místico e o natural. Acompanhar a protagonista no seu descobrimento e na sua inquietação do status quo é outro espetáculo. De todo modo, a incapacidade do ser humano em se entender como parte de um todo e se relacionar com os pares é o ponto alto da narrativa. Para além da trama política, o desenvolvimento psicológico das pessoas é bem trabalhado e revela um pouco de esperança, se posso me dar esse luxo."
    },
    {
        "title": "Eu, Robô (Isaac Asimov)",
        "text": "Cito esta coletânea apenas como referência, uma vez que todos os contos de Asimov estão nesta lista. Como pessoa, estes contos fizeram parte da minha formação, das noites após estudo e dos momentos de locomoção em ônibus. Isaac aloca de modo belo os conceitos de engenharia e ciência em uma linha do tempo altamente coesa. E fica a provocação: com o avanço dos métodos de aprendizado de máquina, estaríamos muito distantes das Máquinas?"
    },
    {
        "title": "Fundação (Isaac Asimov)",
        "text": "Do mesmo modo que os contos fazem parte da minha formação, a trilogia original também faz. Sua ficção é construída a partir de um temor humano recorrente: o prelúdio do fim. A mistura entre história, psicologia e estatística proposta nos livros é particularmente interessante, muito por se mostrar bem coerente. Talvez minha admiração por estas disciplinas tenha sua origem na Fundação. Importante que Isaac não se leva pelo Demônio de Laplace, sua ciência é relativamente boa, mas não é uma bala de prata capaz de prever o futuro com precisão."
    },
    {
        "title": "O mito de Sísifo (Albert Camus)",
        "text": "Uma leitura um tanto deslocada, não me acrescentando muito durante a primeira vez que li. Minha experiência aqui melhorou um pouco após conhecer O Andar do Bêbado, o que me levou a criar um paralelo entre filosofia e estatística. É um tanto difícil para mim comentar mais sobre este tipo de obra, por isso a limitação de apenas ponderar que o processo tem mais valor que o fim."
    },
    {
        "title": "Rápido e devagar: duas formas de pensar (Daniel Kahneman)",
        "text": "Considero libertador, não no sentido transcendental, mas na percepção da pouca racionalidade nas nossas ações. Para além de “pegadinhas mentais”, os estudos sobre o comportamento revelam que existe pouca racionalidade na humanidade. Todavia, este fato não deveria de ser tão incômodo, mas o autor também reserva algumas páginas para comentar sobre isso. Conhecer um pouco mais sobre a própria mente abre possibilidades de compreender melhor o cotidiano."
    },
    {
        "title": "O andar do bêbado: como o acaso determina nossas vidas (Leonard Mlodinow)",
        "text": "Posso dizer que este livro mudou a minha percepção de mundo. A compreensão se amplia após o texto Rápido e Devagar, permitindo traçar paralelos entre o funcionamento do pensamento rápido e a aleatoriedade e estatística. Infelizmente o storytelling não passa de simples ficção, a realidade é mais acidental do que gostaríamos, um fato que conflita bastante com a nossa própria concepção de racionalidade. De todo modo, o mundo se torna menos místico depois desta leitura."
    },
    {
        "title": "Psychological Testing (Colin Cooper)",
        "text": "Denso e focado na parte estatística da psicometria, resolvi deixar este texto como fonte técnica. Do tema, é bem completo considerando métodos empregados, não focando nas formas de desenvolvimento de testes. Trata-se da aplicação de métodos matemáticos dentro, sendo uma leitura interessante no âmbito de compreender algumas aplicações não muito usuais (ou que não deveriam, uma vez que testes psicológicos estão se espalhando como gafanhotos)."
    },
    {
        "title": "Algoritmos de destruição em massa (Cathy O’Neil)",
        "text": "Este é provavelmente uma das obras que considero mais importantes da atualidade. A nossa imersão nessa era virtual nos deixa anestesiados para críticas, de modo que passamos a ser analisados por códigos todo o tempo sem nos importarmos. Padrões de escrita, comportamento ou gostos, nada escapa do poder de coleta e processamento das gigantes de tecnologia. Cathy passa por diversas áreas onde algoritmos, cuja única função é pasteurizar pessoas, fazem uma verdadeira festa macabra, como saúde, educação, finanças e emprego."
    },
    {
        "title": "Sociedade do cansaço (Byung-Chul Han)",
        "text": "Uma das maiores provocações que já presenciei. Muito se fala sobre o desempenho, sobre a positividade e o esforço (meritocracia), mas e o preço? O texto fica particularmente mais interessante após 2020, com a adição de uma nova pandemia à equação da fadiga (tema considerado “superado” pelo autor). Se o paralelo é possível, a negação da ciência discutida por Carl Segan pode ser resultado da positividade extrema comentada por Byung-Chul Han."
    },
    {
        "title": "Deltora Quest (Emily Rodda)",
        "text": "Li estas obras quando muito novo (10-12 anos), porém essa história continua viva em minha memória. Não se trata de uma obra revolucionária por sim, mas por ser tão recorrente em minhas lembranças, de algum modo exerceu um papel de influência no meu modo de pensar e escrever. É bem provável que Emily me influencie na escolha de fantasias, plots e aventuras, então mais do que natural registrar esta série aqui."
    },
    {
        "title": "A Terra Inabitável (David Wallace-Wells)",
        "text": "Muito se fala em mudança climática, mas o debate no cotidiano parece pulverizado. Em alguns momentos focado no aumento do nível dos oceanos, em outros o foco muda para o próprio valor numérico do aumento de temperatura. Todavia, este é um problema sistêmico, os efeitos não são isolados, mas interagem entre si e impactam desde a agricultura até o comportamento. Este texto compila diversos desses estudos pulverizados e tenta construir o grande quebra-cabeça da alteração do clima."
    },
    {
        "title": "O Senhor das Moscas (William Golding)",
        "text": "Das obras que li no passado, esta com certeza é uma das que mais me recordo. As ocorrências da história se tornam mais interessantes quando contrastadas com as ideias de Hobbes. De toda forma, a fragilidade da sociedade e civilização humana são o norte, causando um certo desconforto para o leitor: até onde o certo e errado é pura doutrinação? O conflito entre democracia, tirania e barbárie, em uma visão bem ocidental, é constante. E para aqueles em 2023, talvez a nossa sociedade seja tão frágil quanto a ilha do Senhor das Moscas."
    }
]